app/controllers/microposts_controller.rb

SELECT "microposts".* FROM "microposts" ORDER BY "microposts"."id" DESC LIMIT ?  [["LIMIT", 5]]
---
  def index
    @microposts = Micropost.all.last(5).reverse

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello World!"], ["user_id", 1], ["created_at", "2020-07-14 10:24:37.365972"], ["updated_at", "2020-07-14 10:24:37.365972"]]
---
  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_micropost
      @micropost = Micropost.find(params[:id])